wooseokkim1992-byte/firmware_project/control-stm32/MyApp/hw/sjh_driver/mpu6050.c
#include "mpu6050.h"

#include "i2c.h"
#include "stm32f4xx_hal.h"


/*
 * ============================================================
 * MPU6050 / MPU6500 Compatible Driver
 * ============================================================
 *
 * 프로젝트에서는 MPU6050 모듈 명칭을 사용하지만,
 * WHO_AM_I 값을 확인하여 다음 두 장치를 지원한다.
 *
 * MPU6050 : WHO_AM_I = 0x68
 * MPU6500 : WHO_AM_I = 0x70
 *
 * 현재 실제 사용 중인 센서는 WHO_AM_I 값이 0x70으로
 * 확인되었으므로 MPU6500 계열로 동작한다.
 *
 * 주요 역할
 * ------------------------------------------------------------
 * 1. I2C 장치 탐색
 * 2. WHO_AM_I 확인
 * 3. 센서 Reset / Sleep 해제
 * 4. Sample Rate 설정
 * 5. DLPF 설정
 * 6. Accelerometer / Gyroscope 범위 설정
 * 7. Accel / Temp / Gyro 데이터 읽기
 * 8. Raw 데이터를 실제 단위로 변환
 *
 * 진동 RMS / Peak / 상태 판정은
 * 이 파일에서 처리하지 않는다.
 *
 * 이후 vibration.c / vibration_state.c에서 처리한다.
 * ============================================================
 */


/*
 * ============================================================
 * MPU6050 I2C Address
 * ============================================================
 *
 * AD0 핀 상태에 따라 I2C 주소가 달라진다.
 *
 * AD0 = LOW  → 7bit Address = 0x68
 * AD0 = HIGH → 7bit Address = 0x69
 *
 * STM32 HAL I2C 함수에서는
 * 7bit Address를 왼쪽으로 1bit Shift한 값을 사용한다.
 */
#define MPU6050_ADDRESS_LOW          (0x68U << 1)
#define MPU6050_ADDRESS_HIGH         (0x69U << 1)


/*
 * ============================================================
 * Register Address
 * ============================================================
 */

/*
 * Sample Rate Divider
 */
#define MPU6050_REG_SMPLRT_DIV       0x19U


/*
 * Gyroscope DLPF 설정
 *
 * MPU6050에서는 Accel / Gyro Filter 설정에 사용되고,
 * MPU6500에서는 Gyroscope Filter 설정에 사용한다.
 */
#define MPU6050_REG_CONFIG           0x1AU


/*
 * Gyroscope Full Scale 설정
 */
#define MPU6050_REG_GYRO_CONFIG      0x1BU


/*
 * Accelerometer Full Scale 설정
 */
#define MPU6050_REG_ACCEL_CONFIG     0x1CU


/*
 * MPU6500 Accelerometer DLPF 설정
 *
 * MPU6500에서는 Accelerometer DLPF가
 * 별도의 ACCEL_CONFIG2 레지스터에 존재한다.
 *
 * MPU6050에서는 사용하지 않는다.
 */
#define MPU6500_REG_ACCEL_CONFIG2    0x1DU


/*
 * 센서 데이터 시작 주소
 *
 * 0x3B부터 14byte 연속 Read
 *
 * Accel X
 * Accel Y
 * Accel Z
 * Temperature
 * Gyro X
 * Gyro Y
 * Gyro Z
 *
 * 순서로 읽을 수 있다.
 */
#define MPU6050_REG_ACCEL_XOUT_H     0x3BU


/*
 * Power Management
 */
#define MPU6050_REG_PWR_MGMT_1       0x6BU
#define MPU6050_REG_PWR_MGMT_2       0x6CU


/*
 * WHO_AM_I
 */
#define MPU6050_REG_WHO_AM_I         0x75U


/*
 * ============================================================
 * WHO_AM_I Value
 * ============================================================
 *
 * 실제 센서 종류를 확인하기 위한 Chip ID이다.
 */

#define MPU6050_WHO_AM_I_VALUE       0x68U
#define MPU6500_WHO_AM_I_VALUE       0x70U


/*
 * ============================================================
 * I2C Timeout
 * ============================================================
 *
 * 단위 : ms
 */
#define MPU6050_I2C_TIMEOUT_MS       20U
#define MPU6050_I2C_RETRY_COUNT      3U
#define MPU6050_I2C_RETRY_DELAY_MS   2U
#define MPU6050_POWER_UP_DELAY_MS    100U
#define MPU6050_NO_FAILED_REGISTER   0xFFU


/*
 * ============================================================
 * Scale Factor
 * ============================================================
 */


/*
 * Accelerometer
 *
 * 현재 측정 범위 : ±2g
 *
 * 16384 LSB = 1g
 */
#define MPU6050_ACCEL_SCALE      8192.0f


/*
 * Gyroscope
 *
 * 현재 측정 범위 : ±250 deg/s
 *
 * 131 LSB = 1 deg/s
 */
#define MPU6050_GYRO_SCALE           131.0f


/*
 * ============================================================
 * 내부 상태 변수
 * ============================================================
 *
 * static 변수이므로
 * mpu6050.c 내부에서만 직접 접근할 수 있다.
 */


/*
 * 센서 초기화 성공 여부
 */
static bool is_initialized = false;


/*
 * 현재 사용 중인 I2C Address
 */
static uint16_t device_address = 0U;


/*
 * WHO_AM_I에서 읽은 Chip ID
 *
 * MPU6050 → 0x68
 * MPU6500 → 0x70
 */
static uint8_t chip_id = 0U;


/*
 * 가장 최근 Driver 상태
 */
static mpu6050_status_t current_status =
    MPU6050_STATUS_NOT_INITIALIZED;

/* 가장 최근 I2C 오류와 실패 Register. Live Watch/로그 진단용이다. */
static uint32_t last_i2c_error = HAL_I2C_ERROR_NONE;
static uint8_t failed_register = MPU6050_NO_FAILED_REGISTER;

/* 주소 탐색 실패 원인을 DEVICE_NOT_FOUND와 구분하기 위한 상태이다. */
static bool probe_i2c_error = false;
static bool probe_chip_id_error = false;


/*
 * ============================================================
 * 내부 함수
 * ============================================================
 */


/*
 * MPU6050 Register 1byte Write
 */
static HAL_StatusTypeDef mpu6050_write_register(uint8_t reg,
                                                uint8_t data)
{
    HAL_StatusTypeDef status = HAL_ERROR;

    for (uint8_t attempt = 0U;
         attempt < MPU6050_I2C_RETRY_COUNT;
         attempt++)
    {
        status = HAL_I2C_Mem_Write(
            &hi2c1,
            device_address,
            reg,
            I2C_MEMADD_SIZE_8BIT,
            &data,
            1U,
            MPU6050_I2C_TIMEOUT_MS
        );

        if (status == HAL_OK)
        {
            last_i2c_error = HAL_I2C_ERROR_NONE;
            failed_register = MPU6050_NO_FAILED_REGISTER;
            return HAL_OK;
        }

        last_i2c_error = HAL_I2C_GetError(&hi2c1);
        failed_register = reg;

        if ((attempt + 1U) < MPU6050_I2C_RETRY_COUNT)
        {
            HAL_Delay(MPU6050_I2C_RETRY_DELAY_MS);
        }
    }

    return status;
}


/*
 * MPU6050 Register 1byte Read
 */
static HAL_StatusTypeDef mpu6050_read_register(uint8_t reg,
                                               uint8_t *data)
{
    HAL_StatusTypeDef status = HAL_ERROR;

    for (uint8_t attempt = 0U;
         attempt < MPU6050_I2C_RETRY_COUNT;
         attempt++)
    {
        status = HAL_I2C_Mem_Read(
            &hi2c1,
            device_address,
            reg,
            I2C_MEMADD_SIZE_8BIT,
            data,
            1U,
            MPU6050_I2C_TIMEOUT_MS
        );

        if (status == HAL_OK)
        {
            last_i2c_error = HAL_I2C_ERROR_NONE;
            failed_register = MPU6050_NO_FAILED_REGISTER;
            return HAL_OK;
        }

        last_i2c_error = HAL_I2C_GetError(&hi2c1);
        failed_register = reg;

