wooseokkim1992-byte/firmware_project/control-stm32/MyApp/hw/sjh_driver/mpu6050.c
        if ((attempt + 1U) < MPU6050_I2C_RETRY_COUNT)
        {
            HAL_Delay(MPU6050_I2C_RETRY_DELAY_MS);
        }
    }

    return status;
}


/*
 * 여러 Register를 연속으로 읽는다.
 *
 * 이번 프로젝트에서는
 * Accel → Temp → Gyro
 *
 * 총 14byte를 한 번에 읽는다.
 */
static HAL_StatusTypeDef mpu6050_read_registers(uint8_t start_reg,
                                                uint8_t *data,
                                                uint16_t length)
{
    HAL_StatusTypeDef status = HAL_ERROR;

    for (uint8_t attempt = 0U;
         attempt < MPU6050_I2C_RETRY_COUNT;
         attempt++)
    {
        status = HAL_I2C_Mem_Read(
            &hi2c1,
            device_address,
            start_reg,
            I2C_MEMADD_SIZE_8BIT,
            data,
            length,
            MPU6050_I2C_TIMEOUT_MS
        );

        if (status == HAL_OK)
        {
            last_i2c_error = HAL_I2C_ERROR_NONE;
            failed_register = MPU6050_NO_FAILED_REGISTER;
            return HAL_OK;
        }

        last_i2c_error = HAL_I2C_GetError(&hi2c1);
        failed_register = start_reg;

        if ((attempt + 1U) < MPU6050_I2C_RETRY_COUNT)
        {
            HAL_Delay(MPU6050_I2C_RETRY_DELAY_MS);
        }
    }

    return status;
}


/*
 * ============================================================
 * Chip ID 확인
 * ============================================================
 *
 * 이번 프로젝트에서는
 *
 * MPU6050 : 0x68
 * MPU6500 : 0x70
 *
 * 두 ID를 모두 정상 장치로 인정한다.
 */
static bool mpu6050_is_valid_chip_id(uint8_t id)
{
    return (
        id == MPU6050_WHO_AM_I_VALUE ||
        id == MPU6500_WHO_AM_I_VALUE
    );
}


/*
 * ============================================================
 * 특정 I2C Address 확인
 * ============================================================
 *
 * 1. I2C ACK 확인
 * 2. WHO_AM_I 읽기
 * 3. 지원하는 Chip ID인지 확인
 */
static bool mpu6050_check_address(uint16_t address)
{
    uint8_t who_am_i = 0U;
    HAL_StatusTypeDef ready_status;


    /*
     * --------------------------------------------------------
     * 1. I2C 장치 응답 확인
     * --------------------------------------------------------
     */
    ready_status = HAL_I2C_IsDeviceReady(
            &hi2c1,
            address,
            3U,
            MPU6050_I2C_TIMEOUT_MS);

    if (ready_status != HAL_OK)
    {
        last_i2c_error = HAL_I2C_GetError(&hi2c1);
        failed_register = MPU6050_NO_FAILED_REGISTER;

        /* 단순 주소 NACK(AF)가 아닌 버스 오류는 별도로 기록한다. */
        if ((last_i2c_error != HAL_I2C_ERROR_NONE) &&
            (last_i2c_error != HAL_I2C_ERROR_AF))
        {
            probe_i2c_error = true;
        }

        return false;
    }


    /*
     * 이후 Register Read / Write에 사용할
     * Address 저장
     */
    device_address = address;


    /*
     * --------------------------------------------------------
     * 2. WHO_AM_I 읽기
     * --------------------------------------------------------
     */
    if (mpu6050_read_register(
            MPU6050_REG_WHO_AM_I,
            &who_am_i) != HAL_OK)
    {
        probe_i2c_error = true;
        return false;
    }


    /*
     * Live Watch 등에서 확인할 수 있도록
     * 실제 Chip ID 저장
     */
    chip_id = who_am_i;


    /*
     * --------------------------------------------------------
     * 3. Chip ID 검사
     * --------------------------------------------------------
     *
     * MPU6050 : 0x68
     * MPU6500 : 0x70
     */
    if (!mpu6050_is_valid_chip_id(who_am_i))
    {
        probe_chip_id_error = true;
        failed_register = MPU6050_REG_WHO_AM_I;
        return false;
    }


    return true;
}


/*
 * ============================================================
 * MPU6050 / MPU6500 검색
 * ============================================================
 *
 * AD0 상태에 따라
 *
 * 0x68
 * 0x69
 *
 * 두 I2C Address를 순서대로 확인한다.
 */
static bool mpu6050_find_device(void)
{
    /*
     * AD0 = LOW
     *
     * 가장 일반적인 Address
     */
    if (mpu6050_check_address(MPU6050_ADDRESS_LOW))
    {
        return true;
    }


    /*
     * AD0 = HIGH
     */
    if (mpu6050_check_address(MPU6050_ADDRESS_HIGH))
    {
        return true;
    }


    /*
     * 두 Address에서 장치를 찾지 못함
     */
    device_address = 0U;


    return false;
}


/*
 * ============================================================
 * 비정상 데이터 검사
 * ============================================================
 *
 * 14byte가 전부
 *
 * 0x00
 *
 * 또는
 *
 * 0xFF
 *
 * 인 경우 정상적인 센서 데이터가 아닐 가능성이 높다고
 * 판단한다.
 */
static bool mpu6050_is_invalid_data(const uint8_t *data,
                                    uint16_t length)
{
    bool all_zero = true;
    bool all_ff = true;


    for (uint16_t i = 0U; i < length; i++)
    {
        /*
         * 하나라도 0이 아니면
         * 전체 0 상태가 아니다.
         */
        if (data[i] != 0x00U)
        {
            all_zero = false;
        }


        /*
         * 하나라도 FF가 아니면
         * 전체 FF 상태가 아니다.
         */
        if (data[i] != 0xFFU)
        {
            all_ff = false;
        }
    }


    return (all_zero || all_ff);
}


/*
 * ============================================================
 * MPU6050 초기화
 * ============================================================
 */
bool mpu6050_init(void)
{
    /*
     * 초기 상태 Reset
     */
    is_initialized = false;

    device_address = 0U;

    chip_id = 0U;

    current_status =
        MPU6050_STATUS_NOT_INITIALIZED;

    last_i2c_error = HAL_I2C_ERROR_NONE;

    failed_register = MPU6050_NO_FAILED_REGISTER;

    probe_i2c_error = false;

    probe_chip_id_error = false;


    /*
     * MPU6050 / MPU6500 전원 안정화 대기
     */
    HAL_Delay(MPU6050_POWER_UP_DELAY_MS);


    /*
     * ========================================================
     * 1. I2C 장치 검색 + WHO_AM_I 확인
     * ========================================================
     */
    if (!mpu6050_find_device())
    {
        /* 주소 ACK 이후 Register Read가 실패했거나 버스 오류가 발생함. */
        if (probe_i2c_error)
        {
            current_status =
                MPU6050_STATUS_I2C_ERROR;
        }
        /*
         * I2C 응답은 받았지만
         * 지원하지 않는 WHO_AM_I가 나온 경우
         */
        else if (probe_chip_id_error)
        {
            current_status =
                MPU6050_STATUS_WHO_AM_I_ERROR;
        }

