wooseokkim1992-byte/firmware_project/control-stm32/MyApp/hw/sjh_driver/mpu6050.c
        /*
         * 아예 장치를 발견하지 못한 경우
         */
        else
        {
            current_status =
                MPU6050_STATUS_DEVICE_NOT_FOUND;
        }


        return false;
    }


    /*
     * ========================================================
     * 2. Device Reset
     * ========================================================
     *
     * PWR_MGMT_1
     *
     * bit 7 = DEVICE_RESET
     */
    if (mpu6050_write_register(
            MPU6050_REG_PWR_MGMT_1,
            0x80U) != HAL_OK)
    {
        current_status =
            MPU6050_STATUS_CONFIG_ERROR;


        return false;
    }


    /*
     * Reset 완료 대기
     */
    HAL_Delay(100U);


    /*
     * ========================================================
     * 3. Sleep 해제 + Clock Source
     * ========================================================
     *
     * PWR_MGMT_1 = 0x01
     *
     * SLEEP = 0
     *
     * CLKSEL = 1
     *
     * X축 Gyroscope PLL을 Clock Source로 사용한다.
     */
    if (mpu6050_write_register(
            MPU6050_REG_PWR_MGMT_1,
            0x01U) != HAL_OK)
    {
        current_status =
            MPU6050_STATUS_CONFIG_ERROR;


        return false;
    }


    /*
     * 모든 Accelerometer / Gyroscope 축 활성화
     */
    if (mpu6050_write_register(
            MPU6050_REG_PWR_MGMT_2,
            0x00U) != HAL_OK)
    {
        current_status =
            MPU6050_STATUS_CONFIG_ERROR;


        return false;
    }


    /*
     * 설정 안정화 대기
     */
    HAL_Delay(10U);


    /*
     * ========================================================
     * 4. Gyroscope DLPF
     * ========================================================
     *
     * CONFIG = 0x03
     *
     * MPU6050
     * Gyroscope 약 42 Hz
     *
     * MPU6500
     * Gyroscope 약 41 Hz 수준
     *
     * 회전체에서 발생할 수 있는
     * 불필요한 높은 주파수 노이즈를 줄인다.
     */
    if (mpu6050_write_register(
            MPU6050_REG_CONFIG,
            0x03U) != HAL_OK)
    {
        current_status =
            MPU6050_STATUS_CONFIG_ERROR;


        return false;
    }


    /*
     * ========================================================
     * 5. Sample Rate 설정
     * ========================================================
     *
     * DLPF 사용 시 기본 출력 주파수 = 1kHz
     *
     * Sample Rate =
     *
     * 1000 / (1 + SMPLRT_DIV)
     *
     * SMPLRT_DIV = 7
     *
     * 1000 / 8
     *
     * = 125 Hz
     *
     * 따라서 약 8ms마다 새로운 센서 데이터가 생성된다.
     */
    if (mpu6050_write_register(
            MPU6050_REG_SMPLRT_DIV,
            0x07U) != HAL_OK)
    {
        current_status =
            MPU6050_STATUS_CONFIG_ERROR;


        return false;
    }


    /*
     * ========================================================
     * 6. Gyroscope Full Scale 설정
     * ========================================================
     *
     * GYRO_CONFIG = 0x00
     *
     * FS_SEL = 0
     *
     * ±250 deg/s
     *
     * 131 LSB = 1 deg/s
     */
    if (mpu6050_write_register(
            MPU6050_REG_GYRO_CONFIG,
            0x00U) != HAL_OK)
    {
        current_status =
            MPU6050_STATUS_CONFIG_ERROR;


        return false;
    }


    /*
     * ========================================================
     * 7. Accelerometer Full Scale 설정
     * ========================================================
     *
     * ACCEL_CONFIG = 0x00
     *
     * ±2g
     *
     * 16384 LSB = 1g
     *
     * 작은 진동 변화까지 확인하기 위해
     * 우선 가장 민감한 ±2g 범위를 사용한다.
     */
    if (mpu6050_write_register(
            MPU6050_REG_ACCEL_CONFIG,
            0x08U) != HAL_OK)
    {
        current_status =
            MPU6050_STATUS_CONFIG_ERROR;


        return false;
    }


    /*
     * ========================================================
     * 8. MPU6500 Accelerometer DLPF
     * ========================================================
     *
     * MPU6500에서는 Accelerometer DLPF가
     * ACCEL_CONFIG2에 따로 존재한다.
     *
     * WHO_AM_I = 0x70인 경우에만 설정한다.
     *
     * A_DLPF_CFG = 3
     *
     * Accelerometer 대역폭 약 41Hz 수준
     *
     * MPU6050에서는 이 Register를 설정하지 않는다.
     */
    if (chip_id == MPU6500_WHO_AM_I_VALUE)
    {
        if (mpu6050_write_register(
                MPU6500_REG_ACCEL_CONFIG2,
                0x03U) != HAL_OK)
        {
            current_status =
                MPU6050_STATUS_CONFIG_ERROR;


            return false;
        }
    }


    /*
     * ========================================================
     * 초기화 성공
     * ========================================================
     */
    is_initialized = true;


    current_status =
        MPU6050_STATUS_OK;


    return true;
}


/*
 * ============================================================
 * MPU6050 재초기화
 * ============================================================
 *
 * 통신 오류 등이 발생한 경우
 * 초기화 과정을 처음부터 다시 수행한다.
 */
bool mpu6050_reinit(void)
{
    /* HAL 또는 peripheral이 BUSY/Error 상태에 남아 있으면 함께 복구한다. */
    if (HAL_I2C_DeInit(&hi2c1) != HAL_OK)
    {
        last_i2c_error = HAL_I2C_GetError(&hi2c1);
        current_status = MPU6050_STATUS_I2C_ERROR;
        return false;
    }

    HAL_Delay(MPU6050_I2C_RETRY_DELAY_MS);

    if (HAL_I2C_Init(&hi2c1) != HAL_OK)
    {
        last_i2c_error = HAL_I2C_GetError(&hi2c1);
        current_status = MPU6050_STATUS_I2C_ERROR;
        return false;
    }

    return mpu6050_init();
}


/*
 * ============================================================
 * MPU6050 연결 상태 확인
 * ============================================================
 */
bool mpu6050_is_connected(void)
{
    uint8_t who_am_i = 0U;


    /*
     * 아직 Address를 찾지 못했다면
     * 다시 장치를 검색한다.
     */
    if (device_address == 0U)
    {
        return mpu6050_find_device();
    }


    /*
     * I2C ACK 확인
     */
    if (HAL_I2C_IsDeviceReady(
            &hi2c1,
            device_address,
            3U,
            MPU6050_I2C_TIMEOUT_MS) != HAL_OK)
    {
        return false;
    }


    /*
     * WHO_AM_I 읽기
     */
    if (mpu6050_read_register(
            MPU6050_REG_WHO_AM_I,
            &who_am_i) != HAL_OK)
    {
        return false;
    }


