wooseokkim1992-byte/firmware_project/control-stm32/MyApp/hw/sjh_driver/mpu6050.c
    /*
     * MPU6050 또는 MPU6500이면
     * 정상 연결 상태
     */
    return mpu6050_is_valid_chip_id(who_am_i);
}


/*
 * ============================================================
 * MPU6050 Data Read
 * ============================================================
 */
bool mpu6050_read(mpu6050_data_t *data)
{
    /*
     * ACCEL_XOUT_H(0x3B)부터
     * 총 14byte를 한 번에 읽는다.
     *
     * buffer[0]  = ACCEL_X H
     * buffer[1]  = ACCEL_X L
     *
     * buffer[2]  = ACCEL_Y H
     * buffer[3]  = ACCEL_Y L
     *
     * buffer[4]  = ACCEL_Z H
     * buffer[5]  = ACCEL_Z L
     *
     * buffer[6]  = TEMP H
     * buffer[7]  = TEMP L
     *
     * buffer[8]  = GYRO_X H
     * buffer[9]  = GYRO_X L
     *
     * buffer[10] = GYRO_Y H
     * buffer[11] = GYRO_Y L
     *
     * buffer[12] = GYRO_Z H
     * buffer[13] = GYRO_Z L
     */
    uint8_t buffer[14] = {0U};


    /*
     * ========================================================
     * 입력 Pointer 검사
     * ========================================================
     */
    if (data == 0)
    {
        current_status =
            MPU6050_STATUS_INVALID_ARGUMENT;


        return false;
    }


    /*
     * 읽기 성공 전까지는
     * 유효하지 않은 데이터로 설정한다.
     */
    data->is_valid = false;


    /*
     * ========================================================
     * 초기화 여부 확인
     * ========================================================
     */
    if (!is_initialized)
    {
        current_status =
            MPU6050_STATUS_NOT_INITIALIZED;


        return false;
    }


    /*
     * ========================================================
     * 14byte Burst Read
     * ========================================================
     *
     * 각 축을 각각 읽는 대신
     * 한 번의 I2C 통신으로 읽는다.
     *
     * 통신 횟수를 줄이고
     * 각 축 데이터를 비슷한 시점에 취득할 수 있다.
     */
    if (mpu6050_read_registers(
            MPU6050_REG_ACCEL_XOUT_H,
            buffer,
            14U) != HAL_OK)
    {
        current_status =
            MPU6050_STATUS_I2C_ERROR;


        return false;
    }


    /*
     * ========================================================
     * 비정상 데이터 검사
     * ========================================================
     */
    if (mpu6050_is_invalid_data(
            buffer,
            14U))
    {
        current_status =
            MPU6050_STATUS_DATA_ERROR;


        return false;
    }


    /*
     * ========================================================
     * Accelerometer Raw
     * ========================================================
     *
     * MPU6050 / MPU6500은
     * 상위 Byte → 하위 Byte 순서로 데이터를 전달한다.
     *
     * 따라서 두 byte를 하나의 int16_t로 합친다.
     */
    data->accel_x_raw =
        (int16_t)(
            ((uint16_t)buffer[0] << 8)
            | buffer[1]
        );


    data->accel_y_raw =
        (int16_t)(
            ((uint16_t)buffer[2] << 8)
            | buffer[3]
        );


    data->accel_z_raw =
        (int16_t)(
            ((uint16_t)buffer[4] << 8)
            | buffer[5]
        );


    /*
     * ========================================================
     * Temperature Raw
     * ========================================================
     *
     * A플랜:
     *
     * 내부 온도는 읽어서 보관하지만
     * 진동 분석에는 사용하지 않는다.
     */
    data->temp_raw =
        (int16_t)(
            ((uint16_t)buffer[6] << 8)
            | buffer[7]
        );


    /*
     * ========================================================
     * Gyroscope Raw
     * ========================================================
     */
    data->gyro_x_raw =
        (int16_t)(
            ((uint16_t)buffer[8] << 8)
            | buffer[9]
        );


    data->gyro_y_raw =
        (int16_t)(
            ((uint16_t)buffer[10] << 8)
            | buffer[11]
        );


    data->gyro_z_raw =
        (int16_t)(
            ((uint16_t)buffer[12] << 8)
            | buffer[13]
        );


    /*
     * ========================================================
     * Accelerometer 단위 변환
     * ========================================================
     *
     * 현재 ±2g
     *
     * 16384 LSB = 1g
     *
     * 단위 : g
     *
     * 이후 vibration.c에서
     * accel_x / accel_y / accel_z를 사용한다.
     */
    data->accel_x =
        (float)data->accel_x_raw
        / MPU6050_ACCEL_SCALE;


    data->accel_y =
        (float)data->accel_y_raw
        / MPU6050_ACCEL_SCALE;


    data->accel_z =
        (float)data->accel_z_raw
        / MPU6050_ACCEL_SCALE;


    /*
     * ========================================================
     * Temperature 단위 변환
     * ========================================================
     *
     * MPU6050과 MPU6500은
     * 내부 온도 변환식이 서로 다르다.
     *
     * 온도는 이번 프로젝트에서
     * 참고 / 디버깅용으로만 사용한다.
     */

    if (chip_id == MPU6500_WHO_AM_I_VALUE)
    {
        /*
         * MPU6500
         *
         * Temp =
         * Raw / 333.87 + 21
         */
        data->temp =
            ((float)data->temp_raw / 333.87f)
            + 21.0f;
    }
    else
    {
        /*
         * MPU6050
         *
         * Temp =
         * Raw / 340 + 36.53
         */
        data->temp =
            ((float)data->temp_raw / 340.0f)
            + 36.53f;
    }


    /*
     * ========================================================
     * Gyroscope 단위 변환
     * ========================================================
     *
     * 현재 ±250 deg/s
     *
     * 131 LSB = 1 deg/s
     *
     * 단위 : deg/s
     */
    data->gyro_x =
        (float)data->gyro_x_raw
        / MPU6050_GYRO_SCALE;


    data->gyro_y =
        (float)data->gyro_y_raw
        / MPU6050_GYRO_SCALE;


    data->gyro_z =
        (float)data->gyro_z_raw
        / MPU6050_GYRO_SCALE;


    /*
     * ========================================================
     * 데이터 읽기 성공
     * ========================================================
     */
    data->is_valid = true;


    current_status =
        MPU6050_STATUS_OK;


    return true;
}


/*
 * ============================================================
 * 현재 Driver Status 반환
 * ============================================================
 */
mpu6050_status_t mpu6050_get_status(void)
{
    return current_status;
}


/*
 * ============================================================
 * WHO_AM_I Chip ID 반환
 * ============================================================
 *
 * Live Watch 예상값
 *
 * MPU6050 → 104 = 0x68
 * MPU6500 → 112 = 0x70
 *
 * 현재 센서에서는
 *
 * 112 'p'
 *
 * 로 보이는 것이 정상이다.
 */
uint8_t mpu6050_get_chip_id(void)
{
    return chip_id;
}


/* 가장 최근 STM32 HAL I2C ErrorCode를 반환한다. */
uint32_t mpu6050_get_last_i2c_error(void)
{
    return last_i2c_error;
}


/* 실패한 Register 주소. 주소 탐색 실패이면 0xFF를 반환한다. */
uint8_t mpu6050_get_failed_register(void)
{
    return failed_register;
}
